<html>

<head>
     <title>"Основы PHP" (Дудырин Д.В.)</title>
     <meta name='viewport' content='width=device-width, initial-scale=1.0' charset='utf-8'>
</head>

<body>
     <p>Здесь представлены практические работы, выполненные Дудыриным Дмитрием Вячеславовичем.
     <dl>
          <dt><a href="work1.php">Работа 1 - Версия PHP</a></dt>
          <dd>Вызывается функция phpinfo, которая возвращает информацию об интерпретаторе PHP, установленном в данном HTTP-сервере.</dd>
          <dt><a href="work2.php">Работа 2 - Математические выражения</a></dt>
          <dd>Рассматривается использование простых математических выражений.</dd>
          <dt><a href="work3.php">Работа 3 - Взаимодействие с массивами</a></dt>
          <dd>Рассматривается взаимодействие с массивами.</dd>
          <dt><a href="work4.php">Работа 4 - Условия в PHP</a></dt>
          <dd>Рассматривается взаимодействие с операторами ветвления.</dd>
          <dt><a href="work5.php">Работа 5 - Время и дата в PHP</a></dt>
          <dd>Рассматриваются функции для работы со временем и датой в PHP.</dd>
          <dt><a href="work6.php">Работа 6 - Пользовательские функции в PHP</a></dt>
          <dd>Рассматриваются пользовательские функции в PHP.</dd>
          <dt><a href="work7.php">Работа 7 - Циклы в PHP</a></dt>
          <dd>Рассматриваются циклы в PHP.</dd>
          <dt><a href="work8.php">Работа 8 - Учёт заказов магазина «Автозапчасти» </a></dt>
          <dd>Прием, просмотр и хранение заказов магазина «Автозапчасти»</dd>
          <dt><a href="work9.php">Работа 9 - Информация о студентах </a></dt>
          <dd>Прием, просмотр и хранение ифнормации о студентах</dd>
          <dt><a href="work10.php">Работа 10 - Корни квадратного уравнения </a></dt>
          <dd> Скрипт, который будет находить корни квадратного уравнения</dd>
          <dt><a href="work11.php">Работа 11 - Количество слов и символов в строке </a></dt>
          <dd> Скрипт, который выводит количество слов и символов в строке, вводимой через textarea</dd>
          <dt><a href="work12.php">Работа 12 - Дата и селекты </a></dt>
          <dd> Скрипт, обрабатывающий выбранную дату</dd>
          <dt><a href="work13.php">Работа 13 - Сессии  </a></dt>
          <dd> Рассматривается работа с сессиями</dd>
          <dt><a href="work14">Работа 14 - Учет заказов магазина "Автозапчасти" (база данных)  </a></dt>
          <dd> Прием, просмотр и хранение заказов магазина "Автозапчасти" с помощью базы данных</dd>
          <dt><a href="work15">Работа 15 - Информация о студентах (база данных)  </a></dt>
          <dd> Прием, просмотр и хранение информации о студентах с помощью базы данных</dd>
          <dt><a href="work16.php">Работа 16 - Наследование классов  </a></dt>
          <dd> Создается класс Programmer наследуемый от класса Employee</dd>
          <dt><a href="work17.php">Работа 16 - Класс Tag  </a></dt>
          <dd> Создается класс Tag для упрощения работы с тегами html</dd>
     </dl>
</body>

</html>